SET NAMES UTF8;
#丢弃数据库，如果存在
DROP DATABASE IF EXISTS bookmall;

#创建新的数据库，设置存储的编码
CREATE DATABASE bookmall CHARSET=UTF8;

#进入创建的数据库
USE bookmall;

#1用户个人信息表（bookmall_user）
CREATE TABLE bookmall_user(
	uid INT PRIMARY KEY AUTO_INCREMENT,
	unickname VARCHAR(32) NOT NULL UNIQUE,
	uname VARCHAR(32),
	upwd VARCHAR(32),
	gender INT,
	phone VARCHAR(16) NOT NULL UNIQUE,
	email VARCHAR(64)
);

#2书籍数据表 （bookmall_booksData）
CREATE TABLE bookmall_booksData(
	bid INT PRIMARY KEY AUTO_INCREMENT,
	book_name VARCHAR(64),
	book_author   VARCHAR(64),
	book_classification1  VARCHAR(16),
	book_classification2 VARCHAR(16),
	book_date VARCHAR(32),
	book_price DECIMAL(6,2),
	book_cover VARCHAR(256),
	book_frontView1 VARCHAR(256),
	book_frontView2 VARCHAR(256),
	book_frontView3	VARCHAR(256),
	book_press	VARCHAR(32),
	book_details VARCHAR(1024)
);

#3用户订单表（bookmall_order）
CREATE TABLE bookmall_order(
	orderId  INT PRIMARY KEY AUTO_INCREMENT,
	order_uid  INT,
	order_bid  INT,
	order_book_count INT,
	order_time DATETIME
);

#4首页推荐书籍表 （bookmall_index_recommendation）
CREATE TABLE bookmall_index_recommendation(
	rec_id	INT	PRIMARY KEY AUTO_INCREMENT,
	rec_bid  INT
);

#5独家推送表 （bookmall_index_exclusive）
CREATE TABLE bookmall_index_exclusive (
	exc_id INT PRIMARY KEY AUTO_INCREMENT,
	exc_bid INT
);

#6用户书籍收藏表 （bookmall_collection）
CREATE TABLE bookmall_collection (
	col_id INT PRIMARY KEY AUTO_INCREMENT,
	col_bid	INT,
	col_uid	INT
);

#7用户购物车表 （bookmall_shoppingCart）
CREATE TABLE bookmall_shoppingCart (
	cart_id	INT PRIMARY KEY AUTO_INCREMENT,
	cart_uid INT,
	cart_bid INT,
	cart_book_count	INT
);

#8用户地址表 （bookmall_address）
CREATE TABLE bookmall_address (
	add_id	INT PRIMARY KEY AUTO_INCREMENT,
	add_recipient_name VARCHAR(32) NOT NULL,
	add_province VARCHAR(16),
	add_city VARCHAR(16),
	add_county VARCHAR(16),
	add_address VARCHAR(128),
	add_postcode CHAR(6),
	add_is_default 	BOOLEAN,
	add_uid	INT
);

#9首页新书推送表 （bookmall_address）
CREATE TABLE bookmall_index_newbooks (
	new_id INT PRIMARY KEY AUTO_INCREMENT,
	new_bid INT
);
#教育

#教材
INSERT INTO bookmall_booksData VALUES(NULL,'经济学原理 （第7版）(套装微观经济学分册+宏观经济学分册 曼昆）','（美）曼昆','教育','教材','2015年05月',128.00,'23697183-1_u_1.jpg','23697183-3_u_4.jpg','23697183-4_u_4.jpg','23697183-5_u_3.jpg','北京大学出版社','《经济学原理（第7版）：宏观经济学分册》是目前国内市场上*受欢迎的引进版经济学教材之一，其*特点是它的“学生导向”，它更多地强调经济学原理的应用和政策分析，而非经济学模型。第7版在延续该书一贯风格的同时，对第6版作了全面修订和改进，本书为宏观分册。大幅更新了“新闻摘录”“案例研究”等专栏，例如，围绕金融危机，增加了关于美联储的退出策略和带给经济学家的教训等新话题。');
INSERT INTO bookmall_booksData VALUES(NULL,'高等数学（第七版）（下册）','同济大学数学系','教育','教材','2014年07月',31.30,'25205775-1_w_2.jpg','25205775-1_u_2.jpg','25205775-1_u_2 (1).jpg','25205775-1_u_2 (2).jpg','高等教育出版社','《高等数学（第七版 下册）同步辅导及习题全解（新版）/九章丛书·高校经典教材同步辅导丛书》共有5章，分别介绍向量代数与空间解析几何、多元函数微分法及其应用、重积分、曲线积分与曲面积分、无穷级数。《高等数学（第七版 下册）同步辅导及习题全解（新版）/九章丛书·高校经典教材同步辅导丛书》按教材内容安排全书结构，各章均包括学习导引，知识要点及常考点，本节考研要求，题型、真题、方法，课后习题全解五部分内容。
　　全书按教材内容，针对各章节习题给出详细解答，思路清晰，逻辑性强，循序渐进地帮助读者分析并解决问题，内容详尽，简明易懂。
　　《高等数学（第七版 下册）同步辅导及习题全解（新版）/九章丛书·高校经典教材同步辅导丛书》可作为高等院校学生学习《高等数学（第七版 下册）同步辅导及习题全解（新版）/九章丛书·高校经典教材同步辅导丛书》课程的辅导教材，也可作为考研人员复习备考的辅导教材，同时可供教师备课命题作为参考资料。');
INSERT INTO bookmall_booksData VALUES(NULL,'经济学原理 （第7版）(微观经济学分册 ) 曼昆','（美）曼昆','教育','教材','2015年05月',72.00,'23697254-1_u_1.jpg','23697254-2_u_8.jpg','23697254-3_u_5.jpg','23697254-5_u_3.jpg','北京大学出版社','《经济学原理（第7版）：微观经济学分册》是目前国内市场上*受欢迎的引进版经济学教材之一，其*特点是它的“学生导向”，它更多地强调经济学原理的应用和政策分析，而非经济学模型。本书为微观分册。第7版在延续该书一贯风格的同时，对第7版作了全面修订和改进，大幅更新了“新闻摘录”“案例研究”等专栏，例如增加了以碳税来应对气候变化、网络经济等新话题。');
INSERT INTO bookmall_booksData VALUES(NULL,'普通高等教育国家级重点教材·外国教育史教程（第三版）','吴式颖、李明德','教育','教材','2015年06月',42.50,'23737918-1_u_7.jpg','23737918-2_u_1.jpg','23737918-3_u_6.jpg','23737918-3_u_6 (1).jpg','人民教育出版社',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'组织行为学（第16版）(工商管理经典译丛)','斯蒂芬·罗宾斯 蒂莫西·贾奇','教育','教材','2016年12月',69.10,'24163831-1_u_11.jpg','24163831-2_u_3.jpg','24163831-3_u_3.jpg','24163831-3_u_3 (1).jpg','中国人民大学出版社','本书是罗宾斯教授的一部经典著作，被公认为组织行为学教材的权威标准。自20世纪90年代引进我国以来，深受国内管理学界和企业界的好评，成为*受欢迎和采用量zui大的组织行为学教材。

第16版延续了以往的特色——简洁的写作风格、*前沿的内容、引人入胜的教学方法，并进行了一次全面彻底的修订，在保留*核心内容的同时，反映了zui前沿的组织行为学研究成果以及组织、管理者和员工面临的重要议题。

主要更新包括：重新编写了案例和专栏等材料，并加入新的内容；新增了 “体验练习”及 “综合案例”；将“本章 小结”和“对管理者的启示”进行了区分，方便学生将每章 学到的方法用于工作实践。

本书适合高校本科生、研究生、MBA学员及相关专业学位人员学习使用，还可作为企业管理人员的在职学习和培训用书。');
INSERT INTO bookmall_booksData VALUES(NULL,'内科学（第9版/本科临床/配增值）','葛均波、徐永健、王辰','教育','教材','2018年07月',93.20,'25311561-1_w_3.jpg','25311561-2_u_3.jpg','25311561-3_u_2.jpg','25311561-3_u_2 (1).jpg','人民卫生出版社',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'中医基础理论——十三五规划','郑洪新','教育','教材','2016年08月',30.00,'24019481-1_u_7.jpg','24019481-2_u_3.jpg','24019481-3_u_3.jpg','24019481-3_u_3 (1).jpg','中国中医药出版社','本书阐释和介绍了中医学的基本理论、基本知识和基本思维方法。内容主要包括中医学的哲学基础、藏象、精气血津液神、经络、病因、病机、防治原则等。本教材的编写内容在上版的基础上作了适度调整：除更新了现代研究进展外．删除或降格了部分临床意义不大的内容，增添了对中医临床有指导意义或与后续课程相接轨的内容，如在五行学说中删除了以五行推断病情轻重的相关内容，降格五行胜复为阅读材料，增添了中土五行及其临床应用；在气的运动部分增添了脏腑之气升降运动的理论渊源和临床应用；在藏象中增添了五脏各精气阴阳的生理作用，作为阅读材料．以与后续课程中医诊断学接轨；在体质中增添了九种体质的判定标准为阅读材料，以利于临床应用等。');
INSERT INTO bookmall_booksData VALUES(NULL,'妇产科学（第9版/本科临床/配增值）','谢幸、孔北华、段涛','教育','教材','2018年07月 ',64.80,'25311553-1_u_3.jpg','25311553-2_u_3.jpg','25311553-3_u_3.jpg','25311553-3_u_3 (1).jpg','人民卫生出版社',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'花卉栽培技术','柏玉平，王朝霞，刘晓欣','教育','教材','2016年10月',41.60,'24035432-1_u_4.jpg','24035432-1_u_4 (1).jpg','24035432-2_u_4.jpg','24035432-2_u_4 (1).jpg','化学工业出版社',NULL);

#外语
INSERT INTO bookmall_booksData VALUES(NULL,' 新东方 剑桥KET官方模考题精讲精练1(2020改革版）','[英]剑桥大学英语考评部','教育','外语','2019年10月 ',57.30,'28472121-1_u_3.jpg','28472121-2_u_2.jpg','28472121-3_u_3.jpg','28472121-4_u_3.jpg','浙江教育出版社','
本书引进自剑桥大学出版社，参考了剑桥学习者语料库（Cambridge Learner Corpus）中的大量资料，是KET考试官方备考资料。书中包含6套完整的KET模拟测试题。其中，Test 1和Test 2中提供了教学指导和应试技巧，并设置了拓展技能训练和自测练习板块。6套模拟试题直击KET考试，帮助考生强化考试要求的各项技能，有效备考。');
INSERT INTO bookmall_booksData VALUES(NULL,'英语单词发音密码','杨淑如 陈启欣','教育','外语','2016年12月',47.90,'24167524-1_u_8.jpg','24167524-2_u_10.jpg','24167524-3_u_7.jpg','24167524-4_u_7.jpg','外语教学与研究出版社',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'旅游英语口语：大家的旅行英语入门学习书，图解一看就会','耿小辉，昂秀外语教学研究组','教育','外语','2014年07月 ',25.70,'23494140-1_u_7.jpg','23494140-2_u_5.jpg','23494140-3_u_5.jpg','23494140-4_u_5.jpg','中译出版社（原中国对外翻译出版公司）','1.
7大出国旅行口语话题
乘机、酒店、出行、美食、购物、观光、应急
你想说的都能找到

2.
900句地道口语表达
交流中高频地道单句
按照常用主题分类，方便查找和记忆');
INSERT INTO bookmall_booksData VALUES(NULL,'新东方 美语发音秘诀','（美）安·库克（Ann Cook）','教育','外语','2019年06月',48.80,'27886151-3_u_3.jpg','27886151-1_u_2.jpg','27886151-2_u_3.jpg','27886151-4_u_3.jpg','浙江教育出版社',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'新东方 英语词根词典','[韩]金正基','教育','外语','2019年11月',57.30,'28500435-1_u_3.jpg','28500435-2_u_3.jpg','28500435-3_u_3.jpg','28500435-4_u_3.jpg','群言出版社',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,' 新版中日交流标准日本语中级 上下册（第二版）','人民教育出版社，光村图书出版株式会社','教育','外语','2014年06月',64.50,'23760014-1_u_9.jpg','23760014-2_u_7.jpg','23760014-3_u_6.jpg','23760014-4_u_6.jpg','人民教育出版社','本书是2005年出版的《新版中日交流标准日本语 初级》的第二版，是人民教育出版社与日本光村图书出版株式会社通力合作、精心编写的一套日语自学读本。本书与独立行政法人日本国际交流基金会和财团法人日本国际教育支援协会举办的日本语能力测试N5、N4水平相对应。本书附两张CD和电子书，CD内容包括入门单元和各课生词；电子书内容包括五十音图、各单元课文、生词、重点语法讲解和练习等文字资料及音频资源。本书另配有CD和录音磁带（内容详见封底“录音制品说明”）、广播讲座MP3光盘和同步CD-ROM学习辅导');
INSERT INTO bookmall_booksData VALUES(NULL,'新东方 KET核心词图解+联想巧记速练（2020改革版）','俞敏洪','教育','外语','2019年09月',35.40,'27947272-1_u_3.jpg','27947272-2_u_3.jpg','27947272-3_u_3.jpg','27947272-4_u_3.jpg','浙江教育出版社',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'专四语法与词汇1000题','伍乐其','教育','外语','2019年05月',37.40,'27863820-1_w_4.jpg','27863820-2_u_5.jpg','27863820-3_u_3.jpg','27863820-3_u_3 (1).jpg','世界图书出版公司',NULL);

#中小学辅导
INSERT INTO bookmall_booksData VALUES(NULL,'细菌世界历险记','高士其','教育','中小学辅导','2016年09月',19.40,'24040247-1_u_5.jpg','24040247-2_u_2.jpg','24040247-3_u_2.jpg','24040247-4_u_2.jpg','人民邮电出版社','细菌，一个人人闻之色变的破坏分子。人们认为它是疾病的起源，是健康的敌人，是一切麻烦事的罪魁祸首。但在这本《细菌世界历险记》中，面对人们的指责，它却喊起冤来。书中高士其爷爷化身为细菌的代言人，自称“菌儿”，不仅用自白的方式将细菌的来龙去脉交代得清清楚楚，还透露了不少细菌的秘密和弱点，描述了一个奇异的细菌世界。细菌世界历险记》精选高士其的科普作品62篇，分为科学童话、科学小品和科学趣谈三部分。用通俗易懂的语言将乏味枯燥的物理、生物等科学知识讲得形象生动，彻底揭去了科学的神秘面纱，为读者展现了一个神奇的科学世界。');
INSERT INTO bookmall_booksData VALUES(NULL,'乌丢丢的奇遇','金波','教育','中小学辅导','2015年04月',14.10,'25257593-1_u_10.jpg','25257593-2_u_9.jpg','25257593-3_u_9.jpg','25257593-4_u_8.jpg','北京教育出版社','《乌丢丢的奇遇/儿童文学名家经典书系》是著名儿童文学作家金波的作品，主要讲述了主人公乌丢丢（布袋老人的小木偶丢失的一只小脚丫）为了寻找布袋老人，他去了珍儿的家，得到了一个身体，接着他闯进了吟痴老人的家中，在这里，他认识了一群可爱的朋友，“诗篓子”、木头娃娃、小泥猴、鬃人、不倒翁……体会到了真正的快乐。他开始了寻找布袋爷爷和珍儿的旅程。在远行途中，他碰到了逆风的蝴蝶、种鸡蛋的芸儿，明白了爱、信念，理想的深意。*终，乌丢丢在火海中救出珍儿，将自己变成了珍儿的一只健康的脚。');
INSERT INTO bookmall_booksData VALUES(NULL,'十万个为什么','（苏）米 伊林','教育','中小学辅导','2018年10月',19.40,'26509614-1_u_2.jpg','26509614-3_u_3.jpg','26509614-4_u_3.jpg','26509614-5_u_3.jpg','南方出版社',' 第六版《十万个为什么》由全国政协副主席、中国科学技术协会主席韩启德院士担任总主编， 110余位两院院士组成阵容强大的编委会，为新版《十万》的科学性、前沿性、权威性和可读性提供了*可靠的保证。全书分为基础、专题、热点三大板块，涵盖了从数学、物理、化学到海洋、生物、医学等的共18个分册。全书共600万字，7000余幅彩色版权图片，收入逾4500个代表科技发展前沿和青少年关心的热点问题。新版《十万个为什么》更加注重思考过程，提倡科学精神，引导创造探索，通过“微问题”“微博士”“实验场”“关键词”“科学人”等小栏目激发青少年的好奇心和探究心理。
　　（1）基础板块：数学、物理、化学、天文、地球、生命；
　　（2）专题板块：动物、植物、古生物、医学、建筑与交通、电子与信息；
　　（3）热点板块：大脑与认知、海洋、能源与环境、武器与国防、航天与航空、灾难与防护。
　　全书共600万字，7000余幅彩色图片，收入4500个代表科技发展前沿和青少年关心的热点问题。
');
INSERT INTO bookmall_booksData VALUES(NULL,'中国古代寓言故事','宫利勤','教育','中小学辅导','2013年01月',11.70,'23483790-2_u_5.jpg','23483790-2_u_5 (1).jpg','23483790-3_u_3.jpg','23483790-4_u_2.jpg','人民邮电出版社',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'小学生必背古诗词75+80首','说词解字辞书研究中心','教育','中小学辅导','2014年02月',23.80,'23435948-1_u_23.jpg','23435948-2_u_9.jpg','23435948-3_u_6.jpg','23435948-4_u_6.jpg','华语教学出版社',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'假如给我三天光明','(美) 海伦 凯勒','教育','中小学辅导','2012年07月',12.60,'22800646-1_u_30.jpg','22800646-2_u_22.jpg','22800646-3_u_21.jpg','22800646-4_u_21.jpg','商务印书馆',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'傅雷家书','傅雷','教育','中小学辅导','2017年09月 ',26.30,'25187947-1_u_9.jpg','25187947-2_u_8.jpg','25187947-3_u_8.jpg','25187947-3_u_8 (1).jpg','北岳文艺出版社','《傅雷家书》是傅雷写给孩子傅聪的书信摘编，时间跨度为1954年到1966年，话题没有局限于生活琐事，还涉及到艺术与人生的诸多方面，饱含着为人父母的情感与责任，充满了对子女炽烈而深沉的爱与期望。这些书信，严肃中透出亲切，深刻却不脱离日常，既充满一个长者的人生智慧和经验，也细数了青少年成长的迷茫与欢欣。看似平淡的家常话，如山间的一缕清风，令人回味。这是一对父子，更是一对知己和良师益友，那种心灵和精神上的共鸣、映照，让人艳羡。本次为重新编选之新版，以傅聪的生活为主线，全面展现了傅聪的成长历程和心理变化。较之以往版本更完整，且脉络清晰、不枯燥，更流畅易读。');
INSERT INTO bookmall_booksData VALUES(NULL,'理想树67高考2020新版高考必刷题','杨文彬','教育','中小学辅导','2017年10月',31.80,'28474688-1_u_1.jpg','28474688-2_u_1.jpg','28474688-3_u_1.jpg','28474688-3_u_1 (1).jpg','开明出版社',NULL);


#人文社科

#传统文化
INSERT INTO bookmall_booksData VALUES(NULL,'浮生六记','（清）沈复','人文社科','传统文化','2018年6月',45.80,'25312166-1_w_2.jpg','25312166-2_u_1.jpg','25312166-4_u_3.jpg','25312166-5_u_3.jpg','浙江工商大学出版社','《浮生六记》是浮世生活的诗意写照，堪称一部“生活的艺术”，为清代传记散文中的感人珍品。沈复以“全是人工，却归于天然”的散文，道出人在世上生活的真面目。记闺房之乐，宛如一对情侣就在面前，把酒观月，品诗论画，比翼双飞携手同游人间；写闲时雅趣，栽植花木，游历山水，春夏秋冬皆有情致；叙坎坷人生，满心期望布衣菜饭可乐终身，却不得已颠沛流离，命运曲折。“世事茫茫，光阴有限，算来何必奔忙？”他追求日常生活情趣和心灵自由的人生态度，被后世追慕。
本书以作者的亲身经历，真实反映了中国人的审美情趣、人生遭遇、爱情和家庭的波澜起伏的形态，涉及到古代爱情、家庭伦理、经济文化、山水游历等丰富的主题，折射出传统社会普通人在家庭和生计方面的现实处境及心理面貌，展示了人的一生的不同阶段的际遇和复杂生动的心境，对现代人也极富教益。该书有很高成就，著名文化学者林语堂称赞本书是“足以代表中国生活艺术及文化精神的专著之一”。');
INSERT INTO bookmall_booksData VALUES(NULL,'观山海','杉泽','人文社科','传统文化','2018年6月',160.90,'25278075-1_u_22.jpg','25278075-2_u_19.jpg','25278075-5_u_11.jpg','25278075-3_u_11.jpg','湖南文艺出版社','《观山海》是一部内容丰富、图文并茂的《山海经》通俗读本。

    纵观山海，提笔画神，绘者杉泽在读《山海经》的过程中积累灵感，查阅《中国神怪大辞典》《淮南子》等大量书籍，花费三年时间构思并绘制了数百幅绝美异兽形象，将古老晦涩的文字演绎为笔下妖冶唯美而不失大气的画作，配以精练的原文及精妙的解读，为华夏上古志怪传奇插上另一种想象的翅膀。

    撰者梁超亦对中国传统文化典籍《山海经》有着浓厚兴趣，他的译注在以郝懿行《山海经笺疏》为底本的基础上，参考了郭璞、袁珂等人的校译版本，力求以通俗易懂的白话文进行注解，同时多方参阅古典书籍，做了大量的故事延伸，补充了许多新奇有趣的知识。对于原文中出现的大量生僻字，他还做了汉音标注。可以说，《观山海》是集中华文明与大众审美于一身的中国绝美《山海经》。');
INSERT INTO bookmall_booksData VALUES(NULL,'陆羽茶经','王建荣','人文社科','传统文化','2019年1月',43.40,'25576000-1_u_1.jpg','25576000-3_u_3.jpg','25576000-6_u_3.jpg','25576000-4_u_3.jpg','江苏科学技术出版社',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'念楼学短','锺叔河 后浪','人文社科','传统文化','2018年12月',227.90,'26486620-1_w_3.jpg','26486620-3_u_2.jpg','26486620-4_u_3.jpg','26486620-5_u_2.jpg','湖南美术出版社',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'增广贤全集','陈才俊','人文社科','传统文化','2011年4月',23.60,'21099227-1_w_7.jpg','21099227-2_u_6.jpg','21099227-3_u_6.jpg','21099227-4_u_9.jpg','海潮出版社',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'中国人的传统节日','陈玉新','人文社科','传统文化','2019年9月',57.30,'27942138-1_w_6.jpg','27942138-2_u_2.jpg','27942138-3_u_3.jpg','27942138-4_u_3.jpg','化学工业出版社',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'中国人的二十四节气','邱丙军 ','人文社科','传统文化','2018年5月',47.70,'25260148-1_w_3.jpg','25260148-2_u_3.jpg','25260148-4_u_3.jpg','25260148-3_u_3.jpg','化学工业出版社',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'时间之书：余世存说二十四节气','余世存','人文社科','传统文化','2019年03月',60.80,'26919906-2_u_3.jpg','26919906-1_u_3.jpg','26919906-3_u_2.jpg','26919906-4_u_3.jpg','中国友谊出版公司',NULL);

#历史
INSERT INTO bookmall_booksData VALUES(NULL,'埃及四千年','[英]乔安·弗莱彻','人文社科','历史','2019年3月',102.70,'26917419-1_w_3.jpg','26917419-2_u_3.jpg','26917419-3_u_3.jpg','26917419-4_u_2.jpg','浙江文艺出版社','埃及——世界上*伟大的文明体，其古代故事跨越了四千多年的历史时段，而这一历史时段又塑造了日后整个世界的形态。英国古埃及研究权威、BBC古埃及历史纪录片首席讲解乔安·弗莱彻教授将古埃及的往事连缀成书，完整地讲述出来，记录王朝的兴衰沉浮，并将古埃及人的整个世界呈现于我们每个人都可以理解的一个历史情境之中。

本书是乔安•弗莱切的代表作，作为英国BBC该书电视台相关古埃及解读的系列节目的原著，因此具有BBC纪录片式的客观性和权威性。全书以古埃及4000多年一代代的王朝为阶段，按时间推行的王朝兴衰为轴线来讲述不同王朝的情况，根据考古实物，如壁画、神庙、金字塔等，以及各类出土的文献来还原每代帝王的生活和王朝的发展，同时会记录当时民众的世俗生活。全书按照历史上的王朝分目，共分为20个章节，再现了公元前埃及的数千年历史，是目前国内首部完整讲解古埃及历史的权威之作。');
INSERT INTO bookmall_booksData VALUES(NULL,'国家宝藏','中央电视台综艺频道','人文社科','历史','2018年5月',66.00,'25265530-1_w_8.jpg','25265530-2_u_5.jpg','25265530-3_u_5.jpg','26917419-1_w_3.jpg','中信出版社',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'鼏宅禹迹','孙庆伟','人文社科','历史','2018年5月',98.00,'25270854-1_w_3.png','25270854-2_u_3.png','25270854-3_u_3.jpg','25270854-4_u_3.png','生活.读书.新知三联书店','     中国考古学因古史重建而生，但随着学科的发展，在强调学科独立性的同时，却与历史学渐行渐远。脱离古史重建的“初心”，也令学术界对考古学的旨趣与方法缺少“了解之同情”。

     夏文化探索是中国考古学的“哥德巴赫猜想”，是考古学能否重建古史的试金石。面对学界的纷争与迷茫，本书强调在历史语境下开展考古学研究，以清晰的概念界定、可靠的统计数据和缜密的逻辑分析，将考古材料提升为史料，旗帜鲜明地论证了夏代的信史地位，从而为考古学重建古史确立了一个典型个案。');
INSERT INTO bookmall_booksData VALUES(NULL,'民国往事','萨沙','人文社科','历史','2015年5月',36.50,'23718018-1_u_1.jpg','23718018-2_u_2.jpg','23718018-4_u_3.jpg','23718018-3_u_2.jpg','北京联合出版公司',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'人类简史','[以色列] 尤瓦尔·赫拉利（Yuval Noah Harari）','人文社科','历史','2017年1月',40.80,'24186019-1_w_7.jpg','24186019-3_u_5.jpg','24186019-4_u_6.jpg','24186019-5_u_3.jpg','中信出版社',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'未来简史','［以色列］尤瓦尔·赫拉利','人文社科','历史','2017年1月',40.80,'24170700-1_w_22.jpg','24170700-2_u_16.jpg','24170700-4_u_5.jpg','24170700-5_u_3.jpg','中信出版社',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'中国通史','吕思勉','人文社科','历史','2016年2月',39.60,'23920356-1_w_11.jpg','23920356-2_u_11.jpg','23920356-3_u_11.jpg','23920356-4_u_9.jpg','群言出版社',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'大国的崩溃：苏联解体的台前幕后','[美]沙希利·浦洛基 ','人文社科','历史','2017年05月 ',50.50,'25067758-1_u_3.jpg','25067758-2_u_3.jpg','25067758-3_u_3.jpg','25067758-4_u_2.jpg','四川人民出版社',NULL);

#宗教哲学
INSERT INTO bookmall_booksData VALUES(NULL,'爱神之泪','[法]乔治·巴塔耶','人文社科','宗教哲学','2020年3月',88.00,'28523698-1_w_3.jpg','28523698-2_u_3.jpg','28523698-4_u_3.jpg','28523698-5_u_3.jpg','南京大学出版社','作为“爱欲与死亡的大师”（苏珊·桑塔格语），欲望与死亡是乔治·巴塔耶一生探寻和追问的两大母题。除了《眼睛的故事》《爱德华妲夫人》《我的母亲》等色情小说外，巴塔耶先后出版了三部探讨色情的专著：《色情史》《色情》《爱神之泪》。这本《爱神之泪》是巴塔耶的*后一部作品，可以算是一部另类“色情史”。

本书延续了巴塔耶《色情》《艺术的诞生：拉斯科奇迹》的主题，试图重现艺术进程中色情观念的变迁与兴衰。本书共配有200余幅图片，向我们展示了一系列令人眼花缭乱的图像：从史前的拉斯科壁画到现代的超现实主义绘画，从原始部落的献祭到封建社会的酷刑，爱欲的乐园与死亡的炼狱构成了人类激情的两极。作者在诗性的沉醉和神圣的迷狂中探索欲望的真谛，并借艺术之光，揭露出爱欲背后隐藏的死神面容。

巴塔耶一生都在不懈地追寻爱神，同时又不断地迈向泪水并迷失于泪水。正如书名“爱神之泪”暗示的，象征欢愉的爱神也会陷入悲伤，对于巴塔耶来说，爱与死、色与苦、笑与泪，原本就是一体。这本《爱神之泪》是巴塔耶的*后之书，亦是他的*后之泪。');
INSERT INTO bookmall_booksData VALUES(NULL,'禅者的初心','铃木俊隆','人文社科','宗教哲学','2016年6月',32.90,'23725534-1_w_1.jpg',' 23725534-2_u_3.jpg','23725534-3_u_3.jpg','23978304-1_w_6.jpg','海南出版社',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'沉思录','马可.奥勒留 青豆书坊','人文社科','宗教哲学','2008年2月',47.20,'20086549-2_u_3 (1).jpg','20086549-2_u_8.jpg','20086549-3_u_3.jpg','20086549-4_u_3.jpg','中央编译出版社',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'道德经','（春秋）老子','人文社科','宗教哲学','2016年6月',67.20,'23978304-1_w_6.jpg','23978304-2_u_12.jpg','23978304-3_u_15.jpg','23978304-5_u_9.jpg','作家出版社',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'论语别裁','南怀瑾','人文社科','宗教哲学','2018年5月',93.90,'25274787-2_u_12.jpg','25274787-1_u_11.jpg','25274787-3_u_12.jpg','25274787-4_u_5.jpg','东方出版社',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'透过佛法看世界','希阿荣博堪布','人文社科','宗教哲学','2014年8月',29.90,'23531177-2_u_8.jpg','23531177-1_u_7.jpg','23531177-3_u_4.jpg','23531177-4_u_4.jpg','中信出版社','自从《次第花开》问世以来，越来越多的读者开始了解希阿荣博堪布，并通过短信、微博、邮件等方式向堪布提出各种在生活及佛法修行上的疑问，希望得到指导。这些问题在一定程度上代表了人们的常见疑问，因此我们对这些本自独立的问题进行了编辑和归类。
《透过佛法看世界》包含七个部分，一百八十余个问题，从不同层面、由浅入深地介绍了佛法的基本见解和修行。书中大部分问答为首次公开发表，以前在媒体采访或通过菩提洲网站发表过的部分内容，这次又作了修改和调整，问题是老问题，回答却有新内容。
*辑和第二辑主要阐述佛法能带给人们什么利益，如何从佛法的角度看待平常生活中的一些问题。在第三辑中，围绕有关轮回、因果、苦、慈悲，则更为具体地介绍了佛教在这些方面的基本观点。
第四辑针对已经开始修持佛法的人进行作答，包括如何辨别善知识，如何依止上师，闻思修的内在关系，正念的训练，止观，回向，等等，并特别强调了出离心。
第五辑《死生事大》对学佛者和不学佛者同样重要。因为无论信仰、价值观为何，每个人都不得不面对死和生。既然无可逃避，那么明智的做法就是尽量让自己做好准备。
第六辑《护生》是有关放生的问答。希阿荣博堪布已经发表的关于放生的文章很多，在这本书里，堪布开示的重点是如何改进放生，做到周到、细致。');
INSERT INTO bookmall_booksData VALUES(NULL,'易经杂说','南怀瑾','人文社科','宗教哲学','2015年',69.50,'23686672-1_w_4.jpg','23686672-3_u_3.jpg','23686672-4_u_3.jpg','25274787-1_u_11.jpg','东方出版社','介绍了六十四卦的来历、卜卦的若干种方法，揭示每卦每爻的意义，《易经》与五行、干支、《河图》《洛书》的配合运用，示范了六十四卦的研究方法，说明《序卦》排列六十四卦的理由，阐释了《系传》所揭示的人生和历史哲学，等等，深入浅出，惠泽多方。使《易经》真正成为了一本“与人人有关的书”，而“透过本书的问世，我们希望人人都能获得《易经》的帮助”。（闫修篆语）');
INSERT INTO bookmall_booksData VALUES(NULL,'金刚经说什么','南怀瑾','人文社科','宗教哲学','2016年04月 ',30.30,'23938220-1_u_4.jpg','23938220-2_u_5.jpg','23938220-3_u_3.jpg','23938220-4_u_3.jpg','复旦大学出版社','《金刚经》是初期大乘佛教的重要经典之一，也是般若类佛经的纲要书，传入中国后即广泛流传，千百年来，注经者甚众，对中国文化产生了很大影响。南怀瑾先生在台湾时，曾多次讲解《金刚经》，本书据其一九八〇年在台北十方书院的讲解记录整理而成。南先生以其一贯经史合参的讲法，对经文进行了深入骨髓的剖析，即便于艰深疑难之处，听来也妙趣横生又浅显易明。

如果说《金刚经》超越了一切宗教性，也包含了一切宗教性，那么，南怀瑾先生的讲解正是放下了成见，消除了一切哲学、宗教的界限。');


#生活

#旅游
INSERT INTO bookmall_booksData VALUES(NULL,'分开旅行','陶立夏','生活','旅游','2017年7月',53.10,'25111601-1_w_1.jpg','25111601-2_u_1.jpg','25111601-2_u_7 (1).jpg','25111601-3_u_1.jpg','浙江文艺出版社',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'孤独星球','澳大利亚Lonely Planet公司','生活','旅游','2019年11月',99.00,'28499226-1_u_3.jpg','28499226-2_u_3.jpg','28499226-3_u_3.jpg','28499226-4_u_3.jpg','中国地图出版社',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'惊奇火车','澳大利亚Lonely Planet公司','生活','旅游','2019年10月',118.00,'28499224-1_w_3.jpg','28499224-2_u_3.jpg','28499224-3_u_3.jpg','28499224-4_u_3.jpg','中国地图出版社',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'美好的旅行','《图书天下·国家地理系列》','生活','旅游','2017年1月',29.50,'25168107-1_u_3.jpg','25168107-2_u_3.jpg','25168107-3_u_3.jpg','25168107-5_u_3.jpg','北京联合出版公司',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'去另一种生活','维京飞鸟','生活','旅游','2019年4月',32.90,'27857294-1_w_3.jpg','27857294-2_u_2.jpg','27857294-3_u_2.jpg','27857294-4_u_3.jpg','北京理工大学出版社',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'中国自助游','中国自助游','生活','旅游','2019年8月',62.50,'27925938-1_w_3.jpg','27925938-2_u_3.jpg','27925938-3_u_3.jpg','27925938-5_u_3.jpg','地质出版社','      《2020中国自助游》是畅销19年的《中国自助游》系列的2020年度更新修订版，以专业旅行者的角度，结合独家游探实地反馈的生动感受，以及景点*手资讯，为读者提供在全中国所有省市区进行自助旅游的全面信息，包括交通路线、出行安排、游玩圣地、体验报告、美食住宿推荐等等，满足读者的旅途必需，成为旅游人士喜爱的贴身小助手。本次新版全面复核全书2200处经典景点资讯，新增近120余处热门景点，独家发布2020年旅游趋势报告，提供新潮热门的旅游目的地和路线，以及“N日游”计划。');
INSERT INTO bookmall_booksData VALUES(NULL,'自在京都','库索','生活','旅游','2019年6月',39.00,'27877419-1_u_3.jpg','27877419-2_u_2.jpg','27877419-4_u_3.jpg','27877419-5_u_3.jpg','中信出版社','对某个城市，从邂逅到客居，由旅人变成定居者，必然要经历反思、抉择，并*终鼓起勇气。给予库索力量的是在某一刻，她突然意识到“我应该与我热爱的成为命运共同体”。

于是，她来到京都，体会春樱秋叶，探看神社佛阁，寻访喫茶店、居酒屋……克服恐惧与惊慌，接纳相遇和分离，发现生活的真意不过是自然发生。

在这本书里，是游客视角外一个生活着的京都，是在地者秘而不宣的自在京都。如果你期待一位真正懂京都的人，带你一起探访它；如果你觉得疲倦，想要在日常生活中复制一种叫作“在京都”的理想状态；这本书，总能给你答案');
INSERT INTO bookmall_booksData VALUES(NULL,'怀斯曼生存手册：终极指南','（英）约翰?怀斯曼','生活','旅游','2019年07月',52.50,'27883872-1_u_2.jpg','27883872-2_u_2.jpg','27883872-3_u_1.jpg','27883872-4_u_2.jpg','北方文艺出版社',NULL);

#烹饪
INSERT INTO bookmall_booksData VALUES(NULL,'别说你会吃日料','碗丸 中午十三点','生活','烹饪','2017年3月',33.70,'24242794-1_u_3.jpg','24242794-2_u_3.jpg','24242794-4_u_3.jpg','24242794-5_u_3.jpg','青岛出版社','    怀石、会席、割烹、料亭……各种高大上的名词傻傻分不清？

    握寿司、卷寿司、押寿司、散寿司……各色奇形怪状的饭团，你知道怎么吃？

    怎样判断一枚寿司、一碗鳗鱼饭的优劣？“一汁三菜”又是什么规制？

    日本饮食文化的细腻，即便以繁琐精致著称于世的法国大餐，也从Nouvelle Cuisine起深受日本料理的影响。可是，面对一桌子精美小食，是一上来就用刺身、海鲜和天妇罗解馋，还是刚开场就喝汤？……做个有分寸的吃货，才能get料理师傅的匠心。

    作为 世界非物质文化遗产的“和食”，或本真或奢华，是人类的共同财富。 这本书带你深挖“日料背后的冷知识”，进行一次“日本餐桌大冒险”，在“寻鲜旬鲜”中感受“舌尖上的日本味道”，鞭辟入里地探究“料理间里的技与艺”，*终在一次次饕餮盛宴中提升“一个日料吃货的自我修养”。');
INSERT INTO bookmall_booksData VALUES(NULL,'怀石料理','[日]柴田日本料理研究会、高桥英一','生活','烹饪','2019年8月',174.20,'27928359-1_w_3.jpg','27928359-2_u_3.jpg','27928359-3_u_3.jpg','27928359-5_u_3.jpg','华中科技大学出版社','  怀石原本是一种用于增添浓茶美味的料理，后来才演化为精心烹调，形式却非常简单的精致美食。

《怀石料理基础与应用》依全年12个月介绍多道怀石料理，从需要费些工夫到烹调方法极为简单的料理都有介绍，并加上烹调步骤，十分易懂。除此之外，还介绍了海鲜类的相关知识，如切剖鱼类时必须知道骨架及各鱼种的特征等知识。

《怀石料理基础与应用》从食材到料理的制作皆有着墨。以求在处理食材时，能尽量减少无用的部分，让食材100％都能利用。');
INSERT INTO bookmall_booksData VALUES(NULL,'烤箱料理','萨巴蒂娜','生活','烹饪','2017年8月',34.70,'25183557-2_u_6.jpg','25183557-1_w_3.jpg','25183557-3_u_6.jpg','25183557-4_u_3.jpg','中国轻工业出版社',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'面包','（日）吉野精一','生活','烹饪','2016年9月',98.00,'24019743-1_w_8.jpg','24019743-3_u_11.jpg','24019743-5_u_11.jpg','24019743-7_u_12.jpg','煤炭工业出版社',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'神田裕行的四季料理','[日]神田裕行','生活','烹饪','2019年8月',44.60,'27926705-1_u_3.jpg','27926705-2_u_3.jpg','27926705-3_u_3.jpg','27926705-5_u_3.jpg','青岛出版社',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'早餐美一天','日本凯拉咖啡厅','生活','烹饪','2019年5月',48.00,'27869976-1_w_2.jpg','27869976-2_u_2.jpg','27869976-3_u_2.jpg','27869976-5_u_5.jpg','南海出版公司',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'正宗粤菜','甘智荣','生活','烹饪','2018年9月',30.30,'25277560-1_u_3.jpg','25277560-2_u_3.jpg','25277560-3_u_3.jpg','25277560-4_u_3.jpg','广东人民出版社','粤菜清淡鲜嫩，滋润丰美，散发着淡淡的迷人魅力，极受养*人士的欢迎。本书从食材出发，分为清淡素菜、浓香畜肉、特色禽蛋、粤味水产及粤菜靓汤和主食小点，将正*粤菜一网打尽，让您在家大饱口福，吃得美味、营养。');
INSERT INTO bookmall_booksData VALUES(NULL,'好喝！3分钟爱上中国茶','茶的故事','生活','烹饪','2020年05月 ',53.50,'28527867-1_u_8.jpg','28527867-2_u_9.jpg','28527867-3_u_15.jpg','28527867-4_u_15.jpg','江苏凤凰科学技术出版社','
这是一本关于茶文化和知识的百科图书。本书从一杯好喝的茶对人体身心健康的益处着眼，从历史讲到当下，从产地讲到茶桌，囊括了茶叶的选购、储存、冲泡、品饮等方方面面。全书分为八章：什么是茶、喝茶的常识、怎样泡好一杯茶、如何挑选合适的茶具、如何品味一杯茶、哪款是你*爱的茶、如何选购茶、中国人的茶生活。

本书以独特的角度诠释了如何从众多茶中找到属于自己的那一款。对于茶的历史文化、诸多品种的介绍、冲泡与品饮等，能够带给读者全然不同的认识与理解。');

#养生
INSERT INTO bookmall_booksData VALUES(NULL,'吃出好身材','范志红','生活','养生','2019年7月',77.40,'27895123-5_u_6.jpg','27895123-1_u_2.jpg','27895123-3_u_3.jpg','27895123-7_u_3.jpg','北京科技技术出版社',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'黄帝内经','肖建喜','生活','养生','2020年1月',83.30,'28508891-1_w_1.jpg','28508891-2_u_3.jpg','28508891-3_u_3.jpg','28527978-1_u_6.jpg','吉林科学技术出版社',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'健康日历','丁香医生','生活','养生','2019年8月',69.70,'27907090-1_w_6.jpg','27907090-2_u_1.jpg','27907090-3_u_3.jpg','27907090-5_u_3.jpg','中国轻工业出版社',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'皮肤的秘密','[德]耶尔?阿德勒 (Yael Adler)','生活','养生','2019年2月',59.00,'26512960-1_w_7.jpg','26512960-2_u_5.jpg','26512960-3_u_5.jpg','26512960-5_u_2.jpg','东方出版社','“一个视颜值为一切的时代，无形中为我们催生出巨大的社会压力。各种八卦杂志不遗余力地渲染40岁以上的未婚女性是怎样以一种剩女的面貌存在。一旦演员脸上出现*条小皱纹，便会在入镜前*时间被抹去。

如今，不但是公众人物压力重重，就连我们普通人的日常也渐渐向所谓的“完美”流行趋势靠拢。歧途啊歧途！”

德国著名皮肤医生耶尔·阿德勒博士在她的畅销书《皮肤的秘密》中不禁感叹人们对美的狂热追求！

《皮肤的秘密》是阿德勒博士为大众所写的*本皮肤科普读物。区别于其他美肤化妆手册，它不是一本魔法书，无法向您透露命运的秘密，也不能让您立刻变得完美无瑕疵，更多所涉及的是关于皮肤的奉献、灵魂、使命与气息。

身体气味会影响我们对伴侶的选择；

食用含有高倍浓缩番茄红素的番茄膏比使用任何昂贵的护肤品胜出好几倍；

皮肤衰老、各种斑的“祸首”是紫外线；

在日光浴床上暴晒自己，将会带来无法挽回的伤害；

在头皮上抹褪黑素，可以对抗脱发；

医美范围内剂量合适的肉毒杆菌与透明质酸注射是安全的；

不含矿物油的口红可以抵御唇癌；

性行为之外的很多疾病，安全套也无法预防。

……

当皮肤出问题时，您都可以在这本书中找到原因以及科学的处理方法。

另外，阿德勒博士还鼓励您建立更适合自己的生活方式，接受自己的不完美，愉快生活！');
INSERT INTO bookmall_booksData VALUES(NULL,'神农本草经','《图解经典》','生活','养生','2017年8月',59.50,'25126143-1_w_6.jpg','25126143-2_u_6.jpg','25126143-3_u_3.jpg','25126143-4_u_3.jpg','吉林科技技术出版社',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'文小叔 妙手莲心','文泉杰','生活','养生','2020年3月',38.30,'28527978-1_u_6.jpg','28527978-3_u_6.jpg','28527978-4_u_5.jpg','28527978-5_u_6.jpg','中国中医药出版社',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'学会吃饭','[美]珍·克里斯特勒','生活','养生','2019年7月',89.80,'27884699-1_w_2.jpg','27884699-2_u_6.jpg','27884699-3_u_6.jpg','27884699-4_u_3.jpg','中国友谊出版公司',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'性病535个怎么办','郑和义','生活','养生','2015年03月',23.70,'23665253-1_u_2 (1).jpg','23665253-2_u_2 (1).jpg','23665253-1_u_2.jpg','23665253-2_u_2.jpg','中国协和医科大学出版社',NULL);


#童书

#卡通动漫
INSERT INTO bookmall_booksData VALUES(NULL,'冰雪奇缘','国开童媒','童书','卡通动漫','2019年12月',65.00,'28501267-1_u_2.jpg','28501267-2_u_3.jpg','28501267-4_u_3.jpg','28501267-5_u_3.jpg','国家开放大学出版社','《神秘的声音》讲述了艾莎和安娜长大后虽然失去了双亲，但是关系一直非常和睦。但实际上艾莎一直有个秘密，她总能听见一个神秘的声音。一天晚上发生了意想不到的事情，阿伦黛尔的水和火都消失了，狂风呼啸大地震动。艾莎、安娜、雪宝等人为了拯救阿伦黛尔，跟随神秘的声音开始了北上之旅……

《魔法森林的秘密》讲述了艾莎和安娜等一行人跟随神秘的声音来到了魔法森林中，在这里他们遇到了父亲儿事给他们讲的故事中出现的大坝和人们，并且知道了曾经的往事，遇到了三个自然精灵。为了解救被困在森林中的人们，艾莎等人决定立刻向北出发，继续寻找神秘的声音。

《穿越暗海》讲述了艾莎等人离开了魔法森林，他们发现了父母出海时的沉船，发现了父母出海就是为了寻找艾莎魔法的原因但*后没能渡过黑海。艾莎怕妹妹安娜跟着自己会有危险，利用魔法支开了安娜独自一人来到黑海面对挑战。

《*后的答案》讲述了艾莎独自穿过暗海，来到了神秘的阿塔霍兰河，揭开了尘封多年的惊人秘密，但同时她也被冻成了冰雕。失去了艾莎的魔法，雪宝也消失了。孤独的安娜擦干眼泪，把大地巨人引向了大坝。大地巨人扔石头摧毁了大坝。迷雾消散了，复活的艾莎骑着水之灵拯救了差点被洪水淹没的阿伦黛尔村庄，雪宝也回来了。一切都恢复了正常，阿伦黛尔人和北地人真正愉快地和平共处了。');
INSERT INTO bookmall_booksData VALUES(NULL,'超级飞侠','奥飞娱乐','童书','卡通动漫','2018年1月',76.80,'25156984-1_w_5.jpg','25156984-2_u_6.jpg','25156984-3_u_3.jpg','25156984-4_u_3.jpg','中国纺织出版社',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'海底小纵队探险记','英国Vampire Squid Productions有限公司','童书','卡通动漫','2015年9月',159.60,'23790747-1_w_10.jpg','23790747-2_u_10.jpg','23790747-4_u_9.jpg','23790747-5_u_10.jpg','长江少年儿童出版社',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'恐龙大冒险','[日本]黑川光广 后浪','童书','卡通动漫','2019年1月',97.80,'26512785-1_u_3.jpg','26512785-2_u_3.jpg','26512785-3_u_3.jpg','26512785-4_u_2.jpg','湖南美术出版社',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'没头脑和不高兴','任溶溶','童书','卡通动漫','2018年7月',25.33,'25302042-1_w_5.jpg','25302042-2_u_8.jpg','25302042-4_u_3.jpg','25302042-5_u_3.jpg','上海美术电影制片厂出品',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'神探狗狗系列套装全5册','[美] 戴夫.皮尔奇，译者：孙鹏 浪花朵朵','童书','卡通动漫','2019年6月',195.00,'27893390-1_u_11205.jpg','27893390-2_u_11574.jpg','27893390-4_u_8.jpg','27893390-5_u_7.jpg','花山文艺出版社',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'小猪佩奇','英国快乐瓢虫出版公司','童书','卡通动漫','2013年5月',108.00,'23248697-1_u_25.jpg','23248697-2_u_18.jpg','23248697-3_u_15.jpg','23248697-5_u_8.jpg','安徽少年儿童出版社',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'小学生心理学漫画','小禾心理研究所','童书','卡通动漫','2019年12月',177.10,'28496461-4_u_6.jpg','28496461-2_u_6.jpg','28496461-3_u_6.jpg','28496461-5_u_6.jpg','江苏凤凰文艺出版社',NULL);

#励志成长
INSERT INTO bookmall_booksData VALUES(NULL,'富爸爸穷爸爸','[美]罗伯特·清崎','童书','励志成长','2018年9月',115.60,'26470728-1_w_3.png','26470728-2_u_3.png','26470728-3_u_3.png','26470728-4_u_3.jpg','四川人民出版社',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'10岁开始的经济学','泉美智子','童书','励志成长','2019年10月',128.20,'28477866-1_w_2.jpg','28477866-2_u_3.jpg','28477866-3_u_3.jpg','28477866-5_u_3.jpg','中信出版社',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'思考世界的孩子','[法] 阿内 . 索菲 . 希拉尔 ...','童书','励志成长','2018年1月',142.10,'25205027-1_u_20.jpg','25205027-2_u_5.jpg','25205027-4_u_5.jpg','25205027-5_u_5.jpg','浙江少年儿童出版社',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'小狗钱钱','[德] 博多. 舍费尔','童书','励志成长','2018年4月',72.20,'25259950-1_w_5.jpg','25259950-2_u_6.jpg','25259950-3_u_6.jpg','25259950-4_u_6.jpg','四川少儿出版社',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'致未来的你——给男孩的十五封信','徐鲁','童书','励志成长','2016 年3月',43.10,'23915694-1_u_4.jpg','23915694-2_u_5.jpg','23915694-3_u_6.jpg','23915694-4_u_6 (1).jpg','青岛出版社',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'致未来的你——给女孩的十五封信','殷健灵','童书','励志成长','2013年7月',22.60,'23298807-1_w_2.jpg','23298807-2_u_2.jpg','23298807-3_u_2.jpg','23298807-4_u_2.jpg','青岛出版社',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'做有格局的自己','小麒麟童书馆','童书','励志成长','2019年3月',53.20,'27865520-1_w_8.jpg','27865520-3_u_3.jpg','27865520-4_u_3.jpg','27865520-5_u_3.jpg','天地出版社',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'毕淑敏给孩子的心灵成长书','毕淑敏','童书','励志成长','2016年06月 ',106.90,'23977156-1_u_5.jpg','23977156-2_u_6.jpg','23977156-3_u_6.jpg','23977156-4_u_6.jpg','广西师范大学出版社',NULL);

#中国儿童文学
INSERT INTO bookmall_booksData VALUES(NULL,'大侦探福尔摩斯','柯南 . 道尔','童书','中国儿童文学','2018年2月',108.30,'25224595-1_w_5.jpg','25224595-2_u_2.jpg','25224595-4_u_2.jpg','25224595-5_u_2.jpg','湖北教育出版社',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'姜小牙上学记','北猫','童书','中国儿童文学','2017年10月',81.00,'25178733-1_w_3.jpg','25178733-2_u_3.jpg','25309478-3_u_3.jpg','25309478-4_u_3.jpg','四川少儿出版社',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'少年读史记','张嘉骅','童书','中国儿童文学','2015年9月',86.00,'23778791-1_u_10.jpg','23778791-3_u_13.jpg','23778791-4_u_10.jpg','23778791-5_u_13.jpg','青岛出版社',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'小巴掌童话','张秋生','童书','中国儿童文学','2018年4月',90.70,'25309478-1_w_5.jpg','25309478-2_u_2.jpg','25309478-3_u_3.jpg','25309478-4_u_3.jpg','山东科技技术出版社',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'笑背古诗','刘义良','童书','中国儿童文学','2019年5月',126.00,'27871865-1_w_27.jpg','27871865-3_u_30.jpg','27871865-4_u_31.jpg','27871865-6_u_24.jpg','湖南教育出版社',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'装在口袋里的爸爸','杨鹏','童书','中国儿童文学','2013年12月',102.00,'23205889-2_u_4.jpg','23205889-1_u_2.jpg','23205889-3_u_2.jpg','23205889-5_u_2.jpg','春风文艺出版社',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'资治通鉴少年简读版','何孝荣  侯振龙','童书','中国儿童文学','2019年5月',132.60,'27868330-1_u_2.jpg','27868330-2_u_1.jpg','27868330-4_u_2.jpg','27868330-5_u_2.jpg','青岛出版社',NULL);

#文艺

#摄影
INSERT INTO bookmall_booksData VALUES(NULL,'风光摄影后期基础','Thormas看看世界','文艺','摄影','2018年1月',141.24,'25229945-1_w_6.jpg','25229945-2_u_3.jpg','25229945-3_u_3.jpg','25229945-4_u_3.jpg','电子工业出版社',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'佳能单反摄影入门','雷波','文艺','摄影','2018年11月',51.90,'25577881-1_w_3.jpg','25577881-2_u_2.jpg','25577881-3_u_3.jpg','25577881-4_u_2.jpg','化学工业出版社',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'摄影笔记','宁思潇潇','文艺','摄影','2015年9月',54.50,'23764034-1_u_3.jpg','23764034-2_u_1.jpg','23764034-3_u_1.jpg','23764034-5_u_1.jpg','人民邮电出版社',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'摄影的艺术','[美]Bruce  barnbaum','文艺','摄影','2012年2月',79.10,'22608354-1_u_1.jpg','22608354-2_u_1.jpg','22608354-3_u_1.jpg','22608354-4_u_1.jpg','人民邮电出版社',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'摄影构图','[日] 上田晃司，河野鉄平，杉本恭子，中川文作...','文艺','摄影','2016年7月',46.60,'24003165-1_w_6.jpg','24003165-2_u_4.jpg','24003165-3_u_6.jpg','24003165-4_u_6.jpg','人民邮电出版社',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'手机摄影','杨精坤','文艺','摄影','2019年9月',78.80,'27914901-1_w_5.jpg','27914901-2_u_3.jpg','27914901-3_u_3.jpg','27914901-4_u_3.jpg','化学工业出版社',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'一本摄影书','赵嘉','文艺','摄影','2012年2月',96.00,'22603296-1_u_4.jpg','22603296-2_u_3.jpg','22603296-3_u_3.jpg','22603296-1_u_6 (1).jpg','电子工业出版社',NULL);

#文学
INSERT INTO bookmall_booksData VALUES(NULL,'朝与同歌暮与酒','关东野客','文艺','文学','2019年9月',40.90,'27918847-1_u_9.jpg','27918847-2_u_9.jpg','27918847-3_u_3.jpg','27918847-4_u_3.jpg','江苏凤凰文艺出版社',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'地面飞行','吴磊 后浪','文艺','文学','2020年3月',65.20,'28505323-1_u_11.jpg','28505323-2_u_12.jpg','28505323-4_u_12.jpg','28505323-5_u_9.jpg','中国华侨出版社',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'冷场','李诞','文艺','文学','2018年12月',42.20,'26456953-1_u_4.jpg','26456953-2_u_5.jpg','26456953-3_u_6.jpg','26456953-4_u_6.jpg','四川文艺出版社',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'你是人间四月天','林薇因','文艺','文学','2019年7月',39.30,'27916389-1_u_3.jpg','27916389-3_u_3.jpg','27916389-4_u_3.jpg','27916389-5_u_3.jpg','民主建设出版社',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'若爱世界都可爱','丰子恺','文艺','文学','2019年2月',40.10,'26439841-1_u_5.jpg','26439841-2_u_3.png','26439841-3_u_4.png','26439841-2_u_7 (1).png','时代文艺出版社',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'莎士比亚全集','[英] 莎士比亚 ；译：朱生豪，沈林，何其莘...','文艺','文学','2016年4月',237.50,'23999525-1_u_11.jpg','23999525-2_u_6.jpg','23999525-4_u_18.jpg','23999525-5_u_12.jpg','译林出版社',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'巷里林泉','故园风雨前','文艺','文学','2020年4月',52.10,'28535001-1_u_5.jpg','28535001-2_u_3.jpg','28535001-3_u_3.jpg','28535001-3_u_5 (1).jpg','长江文艺出版社',NULL);

#艺术
INSERT INTO bookmall_booksData VALUES(NULL,'东南园墅','童寯','文艺','艺术','2018年11月',92.00,'25582423-1_w_3.jpg','25582423-2_u_6.jpg','25582423-3_u_5.jpg','25582423-4_u_5.jpg','湖南美术出版社',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'故事','[美] 罗伯特麦基   译：周铁东','文艺','艺术','2014年9月',65.20,'23559102-1_u_4.jpg','23559102-2_u_12.jpg','23559102-3_u_9.jpg','23559102-4_u_7.jpg','天津人民出版社',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'剧透','邱志杰','文艺','艺术','2019年10月',78.80,'27950867-1_u_2.jpg','27950867-3_u_3.jpg','27950867-4_u_3.jpg','27950867-7_u_3.jpg','广西师范大学出版社',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'空的空间','[英] 彼得 . 布鲁克   译：后浪  王翀','文艺','艺术','2019年11月',47.40,'27947891-1_u_3.jpg','27947891-2_u_3.jpg','27947891-3_u_3.jpg','27947891-5_u_3.jpg','中国友谊出版公司',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'无限接近自然','武重义','文艺','艺术','2019年7月',84.30,'27880038-1_u_2.jpg','27880038-2_u_2.jpg','27880038-3_u_2.jpg','27880038-5_u_2.jpg','湖南美术出版社',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'造物有灵且美','赤木明登','文艺','艺术','2015年7月',53.70,'20714377-1_u_6.jpg','20714377-2_u_2.jpg','20714377-4_u_2.jpg','20714377-3_u_2.jpg','湖南美术出版社',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'中国纹样文集','吴山','文艺','艺术','2010年1月',239.40,'20714377-4_u_2.jpg','20714377-1_u_6.jpg','20714377-2_u_2.jpg','20714377-3_u_2.jpg','山东美术出版社',NULL);


#小说

#都市
INSERT INTO bookmall_booksData VALUES(NULL,'北京女子图鉴','王欣 反裤衩阵地','小说','都市','2019年7月',43.2,'27892021-1_u_6.jpg','27892021-2_u_8.jpg','27892021-3_u_9.jpg','27892021-1_w_5.jpg','北京联合出版有限公司',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'蜜友记','小满','小说','都市','2019年10月',38.38,'28478488-1_u_4.jpg','28478488-2_u_3.jpg','28478488-3_u_3.jpg','28478488-5_u_3.jpg','花城出版社',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'花城出版社','谭以牧','小说','都市','2020年6月',38.20,'28525788-1_u_3.jpg','28525788-4_u_3.jpg','28525788-5_u_3.jpg','28525788-6_u_3.jpg','天地出版社',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'首席婚恋师','曹麻子','小说','都市','2019年7月',69.00,'27915819-1_u_3.jpg','27915819-2_u_3.jpg','27915819-3_u_3.jpg','27915819-4_u_3.jpg','北岳文艺出版社',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'网女缤纷','沈涌','小说','都市','2019年9月',55.60,'28471303-1_u_3.jpg','28471303-3_u_3.jpg','28471303-4_u_3.jpg','28471303-7_u_3.jpg','广东人民出版社',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'我们的时代','王强','小说','都市','2019年11月',117.50,'28486321-4_u_3.jpg','28486321-1_u_3.jpg','28486321-3_u_3.jpg','28486321-2_u_3.jpg','人民文学出版社',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'只为遇见你','卿英','小说','都市','2018年6月',33.30,'25300070-1_u_3.jpg','25300070-2_u_2.jpg','25300070-3_u_3.jpg','25300070-2_u_6 (1).jpg','台海出版社',NULL);

#悬疑推理
INSERT INTO bookmall_booksData VALUES(NULL,'盗墓笔记十年','南派三叔','小说','悬疑推理','2019年12月',51.20,'28490256-1_u_3.jpg','28490256-3_u_3.jpg','28490256-4_u_3.jpg','28490256-6_u_3.jpg','北京联合出版有限公司',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'恶意','东野圭吾','小说','悬疑推理','2016年11月',43.00,'24041704-1_u_6.jpg','24041704-2_u_5.jpg','24041704-3_u_5.jpg','24041704-2_u_9.jpg','南海出版公司',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'放学后','东野圭吾','小说','悬疑推理','2017年9月',45.00,'25154615-1_u_3.jpg','25154615-2_u_3.jpg','25154615-3_u_3.jpg','25154615-4_u_3.jpg','南海出版公司',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'鬼吹灯','天下霸唱','小说','悬疑推理','2019年7月',224.50,'27896290-1_u_12.jpg','27896290-2_u_9.jpg','27896290-3_u_6.jpg','27896290-5_u_6.jpg','湖南文艺出版社',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'侯大力刑侦笔记','小桥老树','小说','悬疑推理','2020年4月',44.10,'28522262-1_u_13.jpg','28522262-2_u_6.jpg','28522262-4_u_6.jpg','28522262-5_u_3.jpg','上海文艺出版社',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'守夜者3','秦明','小说','悬疑推理','2019年12月',44.00,'28487540-2_u_3.jpg','28487540-1_u_3.jpg','28487540-4_u_3.jpg','28487540-5_u_3.jpg','北京联合出版有限公司',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'喜鹊谋杀案','[英] 安东尼 . 霍洛维茨  译：梁清新','小说','悬疑推理','2019年6月',69.00,'27876030-3_u_3.jpg','27876030-1_u_3.jpg','27876030-4_u_4.jpg','27876030-5_u_4.jpg','新星出版社',NULL);

#中国近代小说
INSERT INTO bookmall_booksData VALUES(NULL,'北上','徐则臣','小说','中国近代小说','2018年12月',57.30,'25808835-1_u_3.jpg','25808835-2_u_3.jpg','25808835-3_u_6.jpg','25808835-5_u_3.jpg','北京十月文艺出版社',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'边城+湘行散记','沈从文','小说','中国近代小说','2018年10月',78.70,'25547242-1_u_2.jpg','25547242-3_u_2.jpg','25547242-4_u_1.jpg','25547242-5_u_1.jpg','中国妇女出版社',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'房客','[英]  萨拉 . 沃特斯','小说','中国近代小说','2018年7月',59.00,'25312319-1_u_2.jpg','25312319-3_u_3.jpg','25312319-6_u_2.jpg','25312319-8_u_2.jpg','上海人民出版社',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'官场现形记','李宝嘉（李伯元）','小说','中国近代小说','2018年9月',99.00,'25315686-1_u_8.jpg','25315686-3_u_7.jpg','25315686-4_u_8.jpg','25294213-5_u_6.jpg','华东师范大学出版社',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'记得我爱你','凤凰娴','小说','中国近代小说','2019年8月',69.00,'1529807540-1_u_1.jpg','1529807540-2_u_1.jpg','1529807540-3_u_1.jpg','1529807540-5_u_1.jpg','万卷出版社',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'骆驼祥子','老舍','小说','中国近代小说','2018年7月',55.00,'25294213-1_w_9.jpg','25294213-3_u_6.jpg','25294213-4_u_6.jpg','25294213-5_u_6.jpg','华东师范大学出版社',NULL);
INSERT INTO bookmall_booksData VALUES(NULL,'啼笑因缘','张恨水','小说','中国近代小说','2018年12月',47.20,'26470751-1_u_5.jpg','26470751-3_u_5.jpg','26470751-4_u_6.jpg','26470751-5_u_6.jpg','华东师范大学出版社',NULL);

#独家推送表
INSERT INTO bookmall_index_newbooks VALUES(NULL,117);
INSERT INTO bookmall_index_newbooks VALUES(NULL,60);
INSERT INTO bookmall_index_newbooks VALUES(NULL,33);
INSERT INTO bookmall_index_newbooks VALUES(NULL,131);
INSERT INTO bookmall_index_newbooks VALUES(NULL,13);
INSERT INTO bookmall_index_newbooks VALUES(NULL,66);

#首页推荐
INSERT INTO bookmall_index_recommendation VALUES(NULL,23);
INSERT INTO bookmall_index_recommendation VALUES(NULL,95);
INSERT INTO bookmall_index_recommendation VALUES(NULL,47);
INSERT INTO bookmall_index_recommendation VALUES(NULL,73);
INSERT INTO bookmall_index_recommendation VALUES(NULL,15);
INSERT INTO bookmall_index_recommendation VALUES(NULL,39);
INSERT INTO bookmall_index_recommendation VALUES(NULL,41);
INSERT INTO bookmall_index_recommendation VALUES(NULL,90);
INSERT INTO bookmall_index_recommendation VALUES(NULL,46);
INSERT INTO bookmall_index_recommendation VALUES(NULL,124);
INSERT INTO bookmall_index_recommendation VALUES(NULL,123);
INSERT INTO bookmall_index_recommendation VALUES(NULL,130);

#用户信息表(bookmall_user)
INSERT INTO bookmall_user VALUES(1001,"MLXG","世宇",123456,       1,   15698564741,    "15698564741@qq.com");
INSERT INTO bookmall_user VALUES(NULL,"xiaohu","李元浩",123456,   1,   15487458475,    "15487458475@qq.com");
INSERT INTO bookmall_user VALUES(NULL,"Miss","七芯海棠",123456,   0,   17754845748,    "17754845748@qq.com");
INSERT INTO bookmall_user VALUES(NULL,"Uzi","自豪",123456,        1,   18821458754,    "18821458754@qq.com");
INSERT INTO bookmall_user VALUES(NULL,"nanbo","大魔王",123456,    0,   11254875693,    "15698555485@qq.com");
INSERT INTO bookmall_user VALUES(NULL,"heiren","黑人",123456,     1,   15698454127,    "15698454121@qq.com");
INSERT INTO bookmall_user VALUES(NULL,"Nice","好好",123456,       0,   15692154126,    "15698454121@qq.com");
INSERT INTO bookmall_user VALUES(NULL,"ming","小明",123456,       1,   15521454123,    "15698454121@qq.com");
INSERT INTO bookmall_user VALUES(NULL,"yindu","阿三",123456,      0,   15698565467,    "15698565468@qq.com");
INSERT INTO bookmall_user VALUES(NULL,"meiguo","腊鸡",123456,     0,   15575554742,    "15575554741@qq.com");
INSERT INTO bookmall_user VALUES(NULL,"ning","宁王",123456,       1,   15697585744,    "15697585741@qq.com");

#用户订单表(bookmall_order)
/* 字段名称 
orderId  订单编号;   order_uid  用户编号;   order_bid  书籍编号;   order_book_count  购买数量;   order_time  购买时间*/
INSERT INTO bookmall_order VALUES(2020062222, 1009, 22, 1, '2019-12-17 11:20:21' );
INSERT INTO bookmall_order VALUES(NULL, 1008, 13, 1, '2019-12-06 12:34:41' );
INSERT INTO bookmall_order VALUES(NULL, 1005, 25, 2, '2019-12-14 13:23:57' );
INSERT INTO bookmall_order VALUES(NULL, 1007, 31, 3, '2020-02-12 14:43:47' );
INSERT INTO bookmall_order VALUES(NULL, 1003, 21, 1, '2019-11-15 15:22:32' );
INSERT INTO bookmall_order VALUES(NULL, 1004, 30, 4, '2020-06-22 16:11:51' );
INSERT INTO bookmall_order VALUES(NULL, 1005, 12, 2, '2019-11-07 17:34:12' );
INSERT INTO bookmall_order VALUES(NULL, 1008, 11, 1, '2020-05-25 18:13:45' );

#收藏夹列表(bookmall_collection)
/* 字段名称
    col_id #收藏编号;  col_bid  #书籍编号;  col_uid #用户编号;
*/
INSERT INTO bookmall_collection VALUES(2000, 11,  1005);
INSERT INTO bookmall_collection VALUES(NULL, 21,  1005);
INSERT INTO bookmall_collection VALUES(NULL, 31,  1005);
INSERT INTO bookmall_collection VALUES(NULL, 41,  1005);
INSERT INTO bookmall_collection VALUES(NULL, 51,  1005);
INSERT INTO bookmall_collection VALUES(NULL, 61,  1005);
INSERT INTO bookmall_collection VALUES(NULL, 71,  1005);
INSERT INTO bookmall_collection VALUES(NULL, 87,  1005);
INSERT INTO bookmall_collection VALUES(NULL, 81,  1005);
INSERT INTO bookmall_collection VALUES(NULL, 94,  1005);
INSERT INTO bookmall_collection VALUES(NULL, 92,  1005);
INSERT INTO bookmall_collection VALUES(NULL, 95,  1005);
INSERT INTO bookmall_collection VALUES(NULL, 96,  1005);
INSERT INTO bookmall_collection VALUES(NULL, 99,  1005);
INSERT INTO bookmall_collection VALUES(NULL, 83,  1005);
INSERT INTO bookmall_collection VALUES(NULL, 72,  1005);
INSERT INTO bookmall_collection VALUES(NULL, 82,  1005);

#独家推送表(bookmall_index_exclusive)
/*  字段名称
exc_id  推送编号   主键自增
exc_bid  书籍编号
*/
INSERT INTO bookmall_index_exclusive VALUES(1000, 82);
INSERT INTO bookmall_index_exclusive VALUES(NULL, 84);
INSERT INTO bookmall_index_exclusive VALUES(NULL, 86);
INSERT INTO bookmall_index_exclusive VALUES(NULL, 88);
INSERT INTO bookmall_index_exclusive VALUES(NULL, 80);
INSERT INTO bookmall_index_exclusive VALUES(NULL, 74);
INSERT INTO bookmall_index_exclusive VALUES(NULL, 76);
INSERT INTO bookmall_index_exclusive VALUES(NULL, 78);
INSERT INTO bookmall_index_exclusive VALUES(NULL, 70);
INSERT INTO bookmall_index_exclusive VALUES(NULL, 94);
INSERT INTO bookmall_index_exclusive VALUES(NULL, 96);
INSERT INTO bookmall_index_exclusive VALUES(NULL, 98);
INSERT INTO bookmall_index_exclusive VALUES(NULL, 90);
INSERT INTO bookmall_index_exclusive VALUES(NULL, 54);
INSERT INTO bookmall_index_exclusive VALUES(NULL, 56);
INSERT INTO bookmall_index_exclusive VALUES(NULL, 58);
INSERT INTO bookmall_index_exclusive VALUES(NULL, 50);
INSERT INTO bookmall_index_exclusive VALUES(NULL, 64);
INSERT INTO bookmall_index_exclusive VALUES(NULL, 66);
INSERT INTO bookmall_index_exclusive VALUES(NULL, 68);
INSERT INTO bookmall_index_exclusive VALUES(NULL, 60);
INSERT INTO bookmall_index_exclusive VALUES(NULL, 44);
INSERT INTO bookmall_index_exclusive VALUES(NULL, 46);
INSERT INTO bookmall_index_exclusive VALUES(NULL, 48);
INSERT INTO bookmall_index_exclusive VALUES(NULL, 40);
INSERT INTO bookmall_index_exclusive VALUES(NULL,1);
INSERT INTO bookmall_index_exclusive VALUES(NULL,6);
INSERT INTO bookmall_index_exclusive VALUES(NULL,126);
INSERT INTO bookmall_index_exclusive VALUES(NULL,132);
INSERT INTO bookmall_index_exclusive VALUES(NULL,9);
INSERT INTO bookmall_index_exclusive VALUES(NULL,22);

#购物车表 (bookmall_shoppingcart)
/* 字段名称
   cart_id #购物车编号 cart_uid #用户编号 cart_bid #书籍编号; cart_book_count #购买数量
*/
INSERT INTO bookmall_shoppingcart VALUES(3000, 1001, 120, 1);
INSERT INTO bookmall_shoppingcart VALUES(NULL, 1001, 110, 1);
INSERT INTO bookmall_shoppingcart VALUES(NULL, 1001, 132, 1);
INSERT INTO bookmall_shoppingcart VALUES(NULL, 1001, 121, 1);
INSERT INTO bookmall_shoppingcart VALUES(NULL, 1001, 124, 1);
INSERT INTO bookmall_shoppingcart VALUES(NULL, 1001, 129, 1);
INSERT INTO bookmall_shoppingcart VALUES(NULL, 1001, 119, 1);
INSERT INTO bookmall_shoppingcart VALUES(NULL, 1001, 82, 1);

#用户地址表  bookmall_address
/*
	add_id	地址编号
	add_recipient_name  接收人姓名
	add_province  省
	add_city  市
	add_county 县
	add_address  详细地址
	add_postcode 邮编
	add_is_default 是否为当前用户的默认收货地址
	add_uid	INT 用户编号
*/
INSERT INTO bookmall_address VALUES(400, "卢本伟", "浙江省", "杭州市" ,"西湖区","达内幼儿园", NULL, 0 ,1001);
INSERT INTO bookmall_address VALUES(NULL, "五五开", "浙江省", "小宋市" ,"西南区","西南小学", NULL, 0 ,1001);
INSERT INTO bookmall_address VALUES(NULL, "卢姥爷", "浙江省", "夯轴市" ,"拱墅区","拱墅中学", NULL, 0 ,1001);
INSERT INTO bookmall_address VALUES(NULL, "挂比", "浙江省", "亢周市" ,"下沙区","下沙一高", NULL, 0 ,1001);



 